mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf46xk/common/mb9bf46xk.h
#define bFM_GPIO_DDR2_P0                          *((volatile  uint8_t *)(0x42DE4100UL))
#define bFM4_GPIO_DDR2_P0                         *((volatile  uint8_t *)(0x42DE4100UL))
#define bFM_GPIO_DDR2_P1                          *((volatile  uint8_t *)(0x42DE4104UL))
#define bFM4_GPIO_DDR2_P1                         *((volatile  uint8_t *)(0x42DE4104UL))
#define bFM_GPIO_DDR2_P2                          *((volatile  uint8_t *)(0x42DE4108UL))
#define bFM4_GPIO_DDR2_P2                         *((volatile  uint8_t *)(0x42DE4108UL))
#define bFM_GPIO_DDR2_P3                          *((volatile  uint8_t *)(0x42DE410CUL))
#define bFM4_GPIO_DDR2_P3                         *((volatile  uint8_t *)(0x42DE410CUL))

#define bFM_GPIO_DDR3_P0                          *((volatile  uint8_t *)(0x42DE4180UL))
#define bFM4_GPIO_DDR3_P0                         *((volatile  uint8_t *)(0x42DE4180UL))
#define bFM_GPIO_DDR3_P1                          *((volatile  uint8_t *)(0x42DE4184UL))
#define bFM4_GPIO_DDR3_P1                         *((volatile  uint8_t *)(0x42DE4184UL))
#define bFM_GPIO_DDR3_P2                          *((volatile  uint8_t *)(0x42DE4188UL))
#define bFM4_GPIO_DDR3_P2                         *((volatile  uint8_t *)(0x42DE4188UL))
#define bFM_GPIO_DDR3_P3                          *((volatile  uint8_t *)(0x42DE418CUL))
#define bFM4_GPIO_DDR3_P3                         *((volatile  uint8_t *)(0x42DE418CUL))
#define bFM_GPIO_DDR3_P4                          *((volatile  uint8_t *)(0x42DE4190UL))
#define bFM4_GPIO_DDR3_P4                         *((volatile  uint8_t *)(0x42DE4190UL))
#define bFM_GPIO_DDR3_P5                          *((volatile  uint8_t *)(0x42DE4194UL))
#define bFM4_GPIO_DDR3_P5                         *((volatile  uint8_t *)(0x42DE4194UL))

#define bFM_GPIO_DDR4_P6                          *((volatile  uint8_t *)(0x42DE4218UL))
#define bFM4_GPIO_DDR4_P6                         *((volatile  uint8_t *)(0x42DE4218UL))
#define bFM_GPIO_DDR4_P7                          *((volatile  uint8_t *)(0x42DE421CUL))
#define bFM4_GPIO_DDR4_P7                         *((volatile  uint8_t *)(0x42DE421CUL))

#define bFM_GPIO_DDR5_P4                          *((volatile  uint8_t *)(0x42DE4290UL))
#define bFM4_GPIO_DDR5_P4                         *((volatile  uint8_t *)(0x42DE4290UL))
#define bFM_GPIO_DDR5_P5                          *((volatile  uint8_t *)(0x42DE4294UL))
#define bFM4_GPIO_DDR5_P5                         *((volatile  uint8_t *)(0x42DE4294UL))
#define bFM_GPIO_DDR5_P6                          *((volatile  uint8_t *)(0x42DE4298UL))
#define bFM4_GPIO_DDR5_P6                         *((volatile  uint8_t *)(0x42DE4298UL))
#define bFM_GPIO_DDR5_P7                          *((volatile  uint8_t *)(0x42DE429CUL))
#define bFM4_GPIO_DDR5_P7                         *((volatile  uint8_t *)(0x42DE429CUL))

#define bFM_GPIO_DDR6_P0                          *((volatile  uint8_t *)(0x42DE4300UL))
#define bFM4_GPIO_DDR6_P0                         *((volatile  uint8_t *)(0x42DE4300UL))
#define bFM_GPIO_DDR6_P1                          *((volatile  uint8_t *)(0x42DE4304UL))
#define bFM4_GPIO_DDR6_P1                         *((volatile  uint8_t *)(0x42DE4304UL))
#define bFM_GPIO_DDR6_P6                          *((volatile  uint8_t *)(0x42DE4318UL))
#define bFM4_GPIO_DDR6_P6                         *((volatile  uint8_t *)(0x42DE4318UL))

#define bFM_GPIO_DDR8_P0                          *((volatile  uint8_t *)(0x42DE4400UL))
#define bFM4_GPIO_DDR8_P0                         *((volatile  uint8_t *)(0x42DE4400UL))
#define bFM_GPIO_DDR8_P1                          *((volatile  uint8_t *)(0x42DE4404UL))
#define bFM4_GPIO_DDR8_P1                         *((volatile  uint8_t *)(0x42DE4404UL))

#define bFM_GPIO_DDRE_P0                          *((volatile  uint8_t *)(0x42DE4700UL))
#define bFM4_GPIO_DDRE_P0                         *((volatile  uint8_t *)(0x42DE4700UL))
#define bFM_GPIO_DDRE_P2                          *((volatile  uint8_t *)(0x42DE4708UL))
#define bFM4_GPIO_DDRE_P2                         *((volatile  uint8_t *)(0x42DE4708UL))
#define bFM_GPIO_DDRE_P3                          *((volatile  uint8_t *)(0x42DE470CUL))
#define bFM4_GPIO_DDRE_P3                         *((volatile  uint8_t *)(0x42DE470CUL))

#define bFM_GPIO_EPFR00_NMIS                      *((volatile  uint8_t *)(0x42DEC000UL))
#define bFM4_GPIO_EPFR00_NMIS                     *((volatile  uint8_t *)(0x42DEC000UL))
#define bFM_GPIO_EPFR00_USBP0E                    *((volatile  uint8_t *)(0x42DEC024UL))
#define bFM4_GPIO_EPFR00_USBP0E                   *((volatile  uint8_t *)(0x42DEC024UL))
#define bFM_GPIO_EPFR00_USBP1E                    *((volatile  uint8_t *)(0x42DEC034UL))
#define bFM4_GPIO_EPFR00_USBP1E                   *((volatile  uint8_t *)(0x42DEC034UL))
#define bFM_GPIO_EPFR00_JTAGEN0B                  *((volatile  uint8_t *)(0x42DEC040UL))
#define bFM4_GPIO_EPFR00_JTAGEN0B                 *((volatile  uint8_t *)(0x42DEC040UL))
#define bFM_GPIO_EPFR00_JTAGEN1S                  *((volatile  uint8_t *)(0x42DEC044UL))
#define bFM4_GPIO_EPFR00_JTAGEN1S                 *((volatile  uint8_t *)(0x42DEC044UL))
#define bFM_GPIO_EPFR00_TRC0E                     *((volatile  uint8_t *)(0x42DEC060UL))
#define bFM4_GPIO_EPFR00_TRC0E                    *((volatile  uint8_t *)(0x42DEC060UL))
#define bFM_GPIO_EPFR00_TRC1E                     *((volatile  uint8_t *)(0x42DEC064UL))
#define bFM4_GPIO_EPFR00_TRC1E                    *((volatile  uint8_t *)(0x42DEC064UL))

#define bFM_GPIO_EPFR01_DTTI0C                    *((volatile  uint8_t *)(0x42DEC0B0UL))
#define bFM4_GPIO_EPFR01_DTTI0C                   *((volatile  uint8_t *)(0x42DEC0B0UL))

#define bFM_GPIO_EPFR02_DTTI1C                    *((volatile  uint8_t *)(0x42DEC130UL))
#define bFM4_GPIO_EPFR02_DTTI1C                   *((volatile  uint8_t *)(0x42DEC130UL))

#define bFM_GPIO_EPFR03_DTTI2C                    *((volatile  uint8_t *)(0x42DEC1B0UL))
#define bFM4_GPIO_EPFR03_DTTI2C                   *((volatile  uint8_t *)(0x42DEC1B0UL))

#define bFM_GPIO_EPFR10_UEDEFB                    *((volatile  uint8_t *)(0x42DEC500UL))
#define bFM4_GPIO_EPFR10_UEDEFB                   *((volatile  uint8_t *)(0x42DEC500UL))
#define bFM_GPIO_EPFR10_UEDTHB                    *((volatile  uint8_t *)(0x42DEC504UL))
#define bFM4_GPIO_EPFR10_UEDTHB                   *((volatile  uint8_t *)(0x42DEC504UL))
#define bFM_GPIO_EPFR10_UECLKE                    *((volatile  uint8_t *)(0x42DEC508UL))
#define bFM4_GPIO_EPFR10_UECLKE                   *((volatile  uint8_t *)(0x42DEC508UL))
#define bFM_GPIO_EPFR10_UEWEXE                    *((volatile  uint8_t *)(0x42DEC50CUL))
#define bFM4_GPIO_EPFR10_UEWEXE                   *((volatile  uint8_t *)(0x42DEC50CUL))
#define bFM_GPIO_EPFR10_UEDQME                    *((volatile  uint8_t *)(0x42DEC510UL))
#define bFM4_GPIO_EPFR10_UEDQME                   *((volatile  uint8_t *)(0x42DEC510UL))
#define bFM_GPIO_EPFR10_UEOEXE                    *((volatile  uint8_t *)(0x42DEC514UL))
#define bFM4_GPIO_EPFR10_UEOEXE                   *((volatile  uint8_t *)(0x42DEC514UL))
#define bFM_GPIO_EPFR10_UEFLSE                    *((volatile  uint8_t *)(0x42DEC518UL))
#define bFM4_GPIO_EPFR10_UEFLSE                   *((volatile  uint8_t *)(0x42DEC518UL))
#define bFM_GPIO_EPFR10_UECS1E                    *((volatile  uint8_t *)(0x42DEC51CUL))
#define bFM4_GPIO_EPFR10_UECS1E                   *((volatile  uint8_t *)(0x42DEC51CUL))
#define bFM_GPIO_EPFR10_UECS2E                    *((volatile  uint8_t *)(0x42DEC520UL))
#define bFM4_GPIO_EPFR10_UECS2E                   *((volatile  uint8_t *)(0x42DEC520UL))
#define bFM_GPIO_EPFR10_UECS3E                    *((volatile  uint8_t *)(0x42DEC524UL))
#define bFM4_GPIO_EPFR10_UECS3E                   *((volatile  uint8_t *)(0x42DEC524UL))
#define bFM_GPIO_EPFR10_UECS4E                    *((volatile  uint8_t *)(0x42DEC528UL))
#define bFM4_GPIO_EPFR10_UECS4E                   *((volatile  uint8_t *)(0x42DEC528UL))
#define bFM_GPIO_EPFR10_UECS5E                    *((volatile  uint8_t *)(0x42DEC52CUL))
#define bFM4_GPIO_EPFR10_UECS5E                   *((volatile  uint8_t *)(0x42DEC52CUL))
#define bFM_GPIO_EPFR10_UECS6E                    *((volatile  uint8_t *)(0x42DEC530UL))
#define bFM4_GPIO_EPFR10_UECS6E                   *((volatile  uint8_t *)(0x42DEC530UL))
#define bFM_GPIO_EPFR10_UECS7E                    *((volatile  uint8_t *)(0x42DEC534UL))
#define bFM4_GPIO_EPFR10_UECS7E                   *((volatile  uint8_t *)(0x42DEC534UL))
#define bFM_GPIO_EPFR10_UEAOOE                    *((volatile  uint8_t *)(0x42DEC538UL))
#define bFM4_GPIO_EPFR10_UEAOOE                   *((volatile  uint8_t *)(0x42DEC538UL))
#define bFM_GPIO_EPFR10_UEA08E                    *((volatile  uint8_t *)(0x42DEC53CUL))
#define bFM4_GPIO_EPFR10_UEA08E                   *((volatile  uint8_t *)(0x42DEC53CUL))
#define bFM_GPIO_EPFR10_UEA09E                    *((volatile  uint8_t *)(0x42DEC540UL))
#define bFM4_GPIO_EPFR10_UEA09E                   *((volatile  uint8_t *)(0x42DEC540UL))
#define bFM_GPIO_EPFR10_UEA10E                    *((volatile  uint8_t *)(0x42DEC544UL))
#define bFM4_GPIO_EPFR10_UEA10E                   *((volatile  uint8_t *)(0x42DEC544UL))
#define bFM_GPIO_EPFR10_UEA11E                    *((volatile  uint8_t *)(0x42DEC548UL))
#define bFM4_GPIO_EPFR10_UEA11E                   *((volatile  uint8_t *)(0x42DEC548UL))
#define bFM_GPIO_EPFR10_UEA12E                    *((volatile  uint8_t *)(0x42DEC54CUL))
#define bFM4_GPIO_EPFR10_UEA12E                   *((volatile  uint8_t *)(0x42DEC54CUL))
#define bFM_GPIO_EPFR10_UEA13E                    *((volatile  uint8_t *)(0x42DEC550UL))
#define bFM4_GPIO_EPFR10_UEA13E                   *((volatile  uint8_t *)(0x42DEC550UL))
#define bFM_GPIO_EPFR10_UEA14E                    *((volatile  uint8_t *)(0x42DEC554UL))
#define bFM4_GPIO_EPFR10_UEA14E                   *((volatile  uint8_t *)(0x42DEC554UL))
#define bFM_GPIO_EPFR10_UEA15E                    *((volatile  uint8_t *)(0x42DEC558UL))
#define bFM4_GPIO_EPFR10_UEA15E                   *((volatile  uint8_t *)(0x42DEC558UL))
#define bFM_GPIO_EPFR10_UEA16E                    *((volatile  uint8_t *)(0x42DEC55CUL))
#define bFM4_GPIO_EPFR10_UEA16E                   *((volatile  uint8_t *)(0x42DEC55CUL))
#define bFM_GPIO_EPFR10_UEA17E                    *((volatile  uint8_t *)(0x42DEC560UL))
#define bFM4_GPIO_EPFR10_UEA17E                   *((volatile  uint8_t *)(0x42DEC560UL))
#define bFM_GPIO_EPFR10_UEA18E                    *((volatile  uint8_t *)(0x42DEC564UL))
#define bFM4_GPIO_EPFR10_UEA18E                   *((volatile  uint8_t *)(0x42DEC564UL))
#define bFM_GPIO_EPFR10_UEA19E                    *((volatile  uint8_t *)(0x42DEC568UL))
#define bFM4_GPIO_EPFR10_UEA19E                   *((volatile  uint8_t *)(0x42DEC568UL))
#define bFM_GPIO_EPFR10_UEA20E                    *((volatile  uint8_t *)(0x42DEC56CUL))
#define bFM4_GPIO_EPFR10_UEA20E                   *((volatile  uint8_t *)(0x42DEC56CUL))
#define bFM_GPIO_EPFR10_UEA21E                    *((volatile  uint8_t *)(0x42DEC570UL))
#define bFM4_GPIO_EPFR10_UEA21E                   *((volatile  uint8_t *)(0x42DEC570UL))
#define bFM_GPIO_EPFR10_UEA22E                    *((volatile  uint8_t *)(0x42DEC574UL))
#define bFM4_GPIO_EPFR10_UEA22E                   *((volatile  uint8_t *)(0x42DEC574UL))
#define bFM_GPIO_EPFR10_UEA23E                    *((volatile  uint8_t *)(0x42DEC578UL))
#define bFM4_GPIO_EPFR10_UEA23E                   *((volatile  uint8_t *)(0x42DEC578UL))
#define bFM_GPIO_EPFR10_UEA24E                    *((volatile  uint8_t *)(0x42DEC57CUL))
#define bFM4_GPIO_EPFR10_UEA24E                   *((volatile  uint8_t *)(0x42DEC57CUL))

#define bFM_GPIO_EPFR11_UEALEE                    *((volatile  uint8_t *)(0x42DEC580UL))
#define bFM4_GPIO_EPFR11_UEALEE                   *((volatile  uint8_t *)(0x42DEC580UL))
#define bFM_GPIO_EPFR11_UECS0E                    *((volatile  uint8_t *)(0x42DEC584UL))
#define bFM4_GPIO_EPFR11_UECS0E                   *((volatile  uint8_t *)(0x42DEC584UL))
#define bFM_GPIO_EPFR11_UEA01E                    *((volatile  uint8_t *)(0x42DEC588UL))
#define bFM4_GPIO_EPFR11_UEA01E                   *((volatile  uint8_t *)(0x42DEC588UL))
#define bFM_GPIO_EPFR11_UEA02E                    *((volatile  uint8_t *)(0x42DEC58CUL))
#define bFM4_GPIO_EPFR11_UEA02E                   *((volatile  uint8_t *)(0x42DEC58CUL))
#define bFM_GPIO_EPFR11_UEA03E                    *((volatile  uint8_t *)(0x42DEC590UL))
#define bFM4_GPIO_EPFR11_UEA03E                   *((volatile  uint8_t *)(0x42DEC590UL))
#define bFM_GPIO_EPFR11_UEA04E                    *((volatile  uint8_t *)(0x42DEC594UL))
#define bFM4_GPIO_EPFR11_UEA04E                   *((volatile  uint8_t *)(0x42DEC594UL))
#define bFM_GPIO_EPFR11_UEA05E                    *((volatile  uint8_t *)(0x42DEC598UL))
#define bFM4_GPIO_EPFR11_UEA05E                   *((volatile  uint8_t *)(0x42DEC598UL))
#define bFM_GPIO_EPFR11_UEA06E                    *((volatile  uint8_t *)(0x42DEC59CUL))
#define bFM4_GPIO_EPFR11_UEA06E                   *((volatile  uint8_t *)(0x42DEC59CUL))
#define bFM_GPIO_EPFR11_UEA07E                    *((volatile  uint8_t *)(0x42DEC5A0UL))
#define bFM4_GPIO_EPFR11_UEA07E                   *((volatile  uint8_t *)(0x42DEC5A0UL))
#define bFM_GPIO_EPFR11_UED00B                    *((volatile  uint8_t *)(0x42DEC5A4UL))
#define bFM4_GPIO_EPFR11_UED00B                   *((volatile  uint8_t *)(0x42DEC5A4UL))
#define bFM_GPIO_EPFR11_UED01B                    *((volatile  uint8_t *)(0x42DEC5A8UL))
#define bFM4_GPIO_EPFR11_UED01B                   *((volatile  uint8_t *)(0x42DEC5A8UL))
#define bFM_GPIO_EPFR11_UED02B                    *((volatile  uint8_t *)(0x42DEC5ACUL))
#define bFM4_GPIO_EPFR11_UED02B                   *((volatile  uint8_t *)(0x42DEC5ACUL))
#define bFM_GPIO_EPFR11_UED03B                    *((volatile  uint8_t *)(0x42DEC5B0UL))
#define bFM4_GPIO_EPFR11_UED03B                   *((volatile  uint8_t *)(0x42DEC5B0UL))
#define bFM_GPIO_EPFR11_UED04B                    *((volatile  uint8_t *)(0x42DEC5B4UL))
#define bFM4_GPIO_EPFR11_UED04B                   *((volatile  uint8_t *)(0x42DEC5B4UL))
#define bFM_GPIO_EPFR11_UED05B                    *((volatile  uint8_t *)(0x42DEC5B8UL))
#define bFM4_GPIO_EPFR11_UED05B                   *((volatile  uint8_t *)(0x42DEC5B8UL))
#define bFM_GPIO_EPFR11_UED06B                    *((volatile  uint8_t *)(0x42DEC5BCUL))
#define bFM4_GPIO_EPFR11_UED06B                   *((volatile  uint8_t *)(0x42DEC5BCUL))
#define bFM_GPIO_EPFR11_UED07B                    *((volatile  uint8_t *)(0x42DEC5C0UL))
#define bFM4_GPIO_EPFR11_UED07B                   *((volatile  uint8_t *)(0x42DEC5C0UL))
#define bFM_GPIO_EPFR11_UED08B                    *((volatile  uint8_t *)(0x42DEC5C4UL))
#define bFM4_GPIO_EPFR11_UED08B                   *((volatile  uint8_t *)(0x42DEC5C4UL))
#define bFM_GPIO_EPFR11_UED09B                    *((volatile  uint8_t *)(0x42DEC5C8UL))
#define bFM4_GPIO_EPFR11_UED09B                   *((volatile  uint8_t *)(0x42DEC5C8UL))
#define bFM_GPIO_EPFR11_UED10B                    *((volatile  uint8_t *)(0x42DEC5CCUL))
#define bFM4_GPIO_EPFR11_UED10B                   *((volatile  uint8_t *)(0x42DEC5CCUL))
#define bFM_GPIO_EPFR11_UED11B                    *((volatile  uint8_t *)(0x42DEC5D0UL))
#define bFM4_GPIO_EPFR11_UED11B                   *((volatile  uint8_t *)(0x42DEC5D0UL))
#define bFM_GPIO_EPFR11_UED12B                    *((volatile  uint8_t *)(0x42DEC5D4UL))
#define bFM4_GPIO_EPFR11_UED12B                   *((volatile  uint8_t *)(0x42DEC5D4UL))
#define bFM_GPIO_EPFR11_UED13B                    *((volatile  uint8_t *)(0x42DEC5D8UL))
#define bFM4_GPIO_EPFR11_UED13B                   *((volatile  uint8_t *)(0x42DEC5D8UL))
#define bFM_GPIO_EPFR11_UED14B                    *((volatile  uint8_t *)(0x42DEC5DCUL))
#define bFM4_GPIO_EPFR11_UED14B                   *((volatile  uint8_t *)(0x42DEC5DCUL))
#define bFM_GPIO_EPFR11_UED15B                    *((volatile  uint8_t *)(0x42DEC5E0UL))
#define bFM4_GPIO_EPFR11_UED15B                   *((volatile  uint8_t *)(0x42DEC5E0UL))
#define bFM_GPIO_EPFR11_UERLC                     *((volatile  uint8_t *)(0x42DEC5E4UL))
#define bFM4_GPIO_EPFR11_UERLC                    *((volatile  uint8_t *)(0x42DEC5E4UL))

#define bFM_GPIO_EPFR14_E_TD0E                    *((volatile  uint8_t *)(0x42DEC748UL))
#define bFM4_GPIO_EPFR14_E_TD0E                   *((volatile  uint8_t *)(0x42DEC748UL))
#define bFM_GPIO_EPFR14_E_TD1E                    *((volatile  uint8_t *)(0x42DEC74CUL))
#define bFM4_GPIO_EPFR14_E_TD1E                   *((volatile  uint8_t *)(0x42DEC74CUL))
#define bFM_GPIO_EPFR14_E_TE0E                    *((volatile  uint8_t *)(0x42DEC750UL))
#define bFM4_GPIO_EPFR14_E_TE0E                   *((volatile  uint8_t *)(0x42DEC750UL))
#define bFM_GPIO_EPFR14_E_TE1E                    *((volatile  uint8_t *)(0x42DEC754UL))
#define bFM4_GPIO_EPFR14_E_TE1E                   *((volatile  uint8_t *)(0x42DEC754UL))
#define bFM_GPIO_EPFR14_E_MC0E                    *((volatile  uint8_t *)(0x42DEC758UL))
#define bFM4_GPIO_EPFR14_E_MC0E                   *((volatile  uint8_t *)(0x42DEC758UL))
#define bFM_GPIO_EPFR14_E_MC1B                    *((volatile  uint8_t *)(0x42DEC75CUL))
#define bFM4_GPIO_EPFR14_E_MC1B                   *((volatile  uint8_t *)(0x42DEC75CUL))
#define bFM_GPIO_EPFR14_E_MD0B                    *((volatile  uint8_t *)(0x42DEC760UL))
#define bFM4_GPIO_EPFR14_E_MD0B                   *((volatile  uint8_t *)(0x42DEC760UL))
#define bFM_GPIO_EPFR14_E_MD1B                    *((volatile  uint8_t *)(0x42DEC764UL))
#define bFM4_GPIO_EPFR14_E_MD1B                   *((volatile  uint8_t *)(0x42DEC764UL))
#define bFM_GPIO_EPFR14_E_CKE                     *((volatile  uint8_t *)(0x42DEC768UL))
#define bFM4_GPIO_EPFR14_E_CKE                    *((volatile  uint8_t *)(0x42DEC768UL))
#define bFM_GPIO_EPFR14_E_PSE                     *((volatile  uint8_t *)(0x42DEC76CUL))
#define bFM4_GPIO_EPFR14_E_PSE                    *((volatile  uint8_t *)(0x42DEC76CUL))

