mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf46xk/common/mb9bf46xk.h
#define bFM_MFT0_FRT_TCAL_STOP00                  *((volatile  uint32_t*)(0x42402C80UL))
#define bFM4_MFT0_FRT_TCAL_STOP00                 *((volatile  uint32_t*)(0x42402C80UL))
#define bFM_MFT0_FRT_TCAL_STOP01                  *((volatile  uint32_t*)(0x42402C84UL))
#define bFM4_MFT0_FRT_TCAL_STOP01                 *((volatile  uint32_t*)(0x42402C84UL))
#define bFM_MFT0_FRT_TCAL_STOP02                  *((volatile  uint32_t*)(0x42402C88UL))
#define bFM4_MFT0_FRT_TCAL_STOP02                 *((volatile  uint32_t*)(0x42402C88UL))
#define bFM_MFT0_FRT_TCAL_STOP10                  *((volatile  uint32_t*)(0x42402C8CUL))
#define bFM4_MFT0_FRT_TCAL_STOP10                 *((volatile  uint32_t*)(0x42402C8CUL))
#define bFM_MFT0_FRT_TCAL_STOP11                  *((volatile  uint32_t*)(0x42402C90UL))
#define bFM4_MFT0_FRT_TCAL_STOP11                 *((volatile  uint32_t*)(0x42402C90UL))
#define bFM_MFT0_FRT_TCAL_STOP12                  *((volatile  uint32_t*)(0x42402C94UL))
#define bFM4_MFT0_FRT_TCAL_STOP12                 *((volatile  uint32_t*)(0x42402C94UL))
#define bFM_MFT0_FRT_TCAL_STOP20                  *((volatile  uint32_t*)(0x42402C98UL))
#define bFM4_MFT0_FRT_TCAL_STOP20                 *((volatile  uint32_t*)(0x42402C98UL))
#define bFM_MFT0_FRT_TCAL_STOP21                  *((volatile  uint32_t*)(0x42402C9CUL))
#define bFM4_MFT0_FRT_TCAL_STOP21                 *((volatile  uint32_t*)(0x42402C9CUL))
#define bFM_MFT0_FRT_TCAL_STOP22                  *((volatile  uint32_t*)(0x42402CA0UL))
#define bFM4_MFT0_FRT_TCAL_STOP22                 *((volatile  uint32_t*)(0x42402CA0UL))
#define bFM_MFT0_FRT_TCAL_SCLR00                  *((volatile  uint32_t*)(0x42402CC0UL))
#define bFM4_MFT0_FRT_TCAL_SCLR00                 *((volatile  uint32_t*)(0x42402CC0UL))
#define bFM_MFT0_FRT_TCAL_SCLR01                  *((volatile  uint32_t*)(0x42402CC4UL))
#define bFM4_MFT0_FRT_TCAL_SCLR01                 *((volatile  uint32_t*)(0x42402CC4UL))
#define bFM_MFT0_FRT_TCAL_SCLR02                  *((volatile  uint32_t*)(0x42402CC8UL))
#define bFM4_MFT0_FRT_TCAL_SCLR02                 *((volatile  uint32_t*)(0x42402CC8UL))
#define bFM_MFT0_FRT_TCAL_SCLR10                  *((volatile  uint32_t*)(0x42402CCCUL))
#define bFM4_MFT0_FRT_TCAL_SCLR10                 *((volatile  uint32_t*)(0x42402CCCUL))
#define bFM_MFT0_FRT_TCAL_SCLR11                  *((volatile  uint32_t*)(0x42402CD0UL))
#define bFM4_MFT0_FRT_TCAL_SCLR11                 *((volatile  uint32_t*)(0x42402CD0UL))
#define bFM_MFT0_FRT_TCAL_SCLR12                  *((volatile  uint32_t*)(0x42402CD4UL))
#define bFM4_MFT0_FRT_TCAL_SCLR12                 *((volatile  uint32_t*)(0x42402CD4UL))
#define bFM_MFT0_FRT_TCAL_SCLR20                  *((volatile  uint32_t*)(0x42402CD8UL))
#define bFM4_MFT0_FRT_TCAL_SCLR20                 *((volatile  uint32_t*)(0x42402CD8UL))
#define bFM_MFT0_FRT_TCAL_SCLR21                  *((volatile  uint32_t*)(0x42402CDCUL))
#define bFM4_MFT0_FRT_TCAL_SCLR21                 *((volatile  uint32_t*)(0x42402CDCUL))
#define bFM_MFT0_FRT_TCAL_SCLR22                  *((volatile  uint32_t*)(0x42402CE0UL))
#define bFM4_MFT0_FRT_TCAL_SCLR22                 *((volatile  uint32_t*)(0x42402CE0UL))

#define bFM_MFT0_FRT_TCSA0_SCLR                   *((volatile  uint8_t *)(0x42402910UL))
#define bFM4_MFT0_FRT_TCSA0_SCLR                  *((volatile  uint8_t *)(0x42402910UL))
#define bFM_MFT0_FRT_TCSA0_MODE                   *((volatile  uint8_t *)(0x42402914UL))
#define bFM4_MFT0_FRT_TCSA0_MODE                  *((volatile  uint8_t *)(0x42402914UL))
#define bFM_MFT0_FRT_TCSA0_STOP                   *((volatile  uint8_t *)(0x42402918UL))
#define bFM4_MFT0_FRT_TCSA0_STOP                  *((volatile  uint8_t *)(0x42402918UL))
#define bFM_MFT0_FRT_TCSA0_BFE                    *((volatile  uint8_t *)(0x4240291CUL))
#define bFM4_MFT0_FRT_TCSA0_BFE                   *((volatile  uint8_t *)(0x4240291CUL))
#define bFM_MFT0_FRT_TCSA0_ICRE                   *((volatile  uint8_t *)(0x42402920UL))
#define bFM4_MFT0_FRT_TCSA0_ICRE                  *((volatile  uint8_t *)(0x42402920UL))
#define bFM_MFT0_FRT_TCSA0_ICLR                   *((volatile  uint8_t *)(0x42402924UL))
#define bFM4_MFT0_FRT_TCSA0_ICLR                  *((volatile  uint8_t *)(0x42402924UL))
#define bFM_MFT0_FRT_TCSA0_IRQZE                  *((volatile  uint8_t *)(0x42402934UL))
#define bFM4_MFT0_FRT_TCSA0_IRQZE                 *((volatile  uint8_t *)(0x42402934UL))
#define bFM_MFT0_FRT_TCSA0_IRQZF                  *((volatile  uint8_t *)(0x42402938UL))
#define bFM4_MFT0_FRT_TCSA0_IRQZF                 *((volatile  uint8_t *)(0x42402938UL))
#define bFM_MFT0_FRT_TCSA0_ECKE                   *((volatile  uint8_t *)(0x4240293CUL))
#define bFM4_MFT0_FRT_TCSA0_ECKE                  *((volatile  uint8_t *)(0x4240293CUL))

#define bFM_MFT0_FRT_TCSA1_SCLR                   *((volatile  uint8_t *)(0x42402A90UL))
#define bFM4_MFT0_FRT_TCSA1_SCLR                  *((volatile  uint8_t *)(0x42402A90UL))
#define bFM_MFT0_FRT_TCSA1_MODE                   *((volatile  uint8_t *)(0x42402A94UL))
#define bFM4_MFT0_FRT_TCSA1_MODE                  *((volatile  uint8_t *)(0x42402A94UL))
#define bFM_MFT0_FRT_TCSA1_STOP                   *((volatile  uint8_t *)(0x42402A98UL))
#define bFM4_MFT0_FRT_TCSA1_STOP                  *((volatile  uint8_t *)(0x42402A98UL))
#define bFM_MFT0_FRT_TCSA1_BFE                    *((volatile  uint8_t *)(0x42402A9CUL))
#define bFM4_MFT0_FRT_TCSA1_BFE                   *((volatile  uint8_t *)(0x42402A9CUL))
#define bFM_MFT0_FRT_TCSA1_ICRE                   *((volatile  uint8_t *)(0x42402AA0UL))
#define bFM4_MFT0_FRT_TCSA1_ICRE                  *((volatile  uint8_t *)(0x42402AA0UL))
#define bFM_MFT0_FRT_TCSA1_ICLR                   *((volatile  uint8_t *)(0x42402AA4UL))
#define bFM4_MFT0_FRT_TCSA1_ICLR                  *((volatile  uint8_t *)(0x42402AA4UL))
#define bFM_MFT0_FRT_TCSA1_IRQZE                  *((volatile  uint8_t *)(0x42402AB4UL))
#define bFM4_MFT0_FRT_TCSA1_IRQZE                 *((volatile  uint8_t *)(0x42402AB4UL))
#define bFM_MFT0_FRT_TCSA1_IRQZF                  *((volatile  uint8_t *)(0x42402AB8UL))
#define bFM4_MFT0_FRT_TCSA1_IRQZF                 *((volatile  uint8_t *)(0x42402AB8UL))
#define bFM_MFT0_FRT_TCSA1_ECKE                   *((volatile  uint8_t *)(0x42402ABCUL))
#define bFM4_MFT0_FRT_TCSA1_ECKE                  *((volatile  uint8_t *)(0x42402ABCUL))

